# Current Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTableIterator..::..Current Property
ExportLinetypeTableIterator Class See Also
---
Gets the item at the current position of the iterator.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo> Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportLinetypeKey, ExportLinetypeInfo)
	Get
```

Visual C++
---
```text
public:
virtual property KeyValuePair<ExportLinetypeKey^, ExportLinetypeInfo^> Current {
	KeyValuePair<ExportLinetypeKey^, ExportLinetypeInfo^> get ();
}
```

# ### Implements
IEnumerator<(Of <(<'T>)>)>..::..Current
# Remarks
There is no current item if the iterator has not started yet or has been done.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
ExportLinetypeTableIterator Class
Autodesk.Revit.DB Namespace